app/controllers/apuracaos_controller.rb

SELECT * FROM `apuracaos`
SELECT * FROM `apuracaos` LIMIT 0, 15
---
  def index
      if params[:search].blank?
          @search = Apuracao.search(params[:search])
          @apuracaos = @search.paginate(:page=>params[:page],:per_page =>1000, :order => "total DESC")

SELECT * FROM `apuracaos` WHERE (`apuracaos`.formulario_id = 2) LIMIT 1
---
  def show
    @apuracao = Apuracao.find(params[:id])

SELECT * FROM `apuracaos` WHERE (`apuracaos`.`id` = 1)
---
  def edit
    @apuracao = Apuracao.find(params[:id])

INSERT INTO `apuracaos` (`formulario_id`, `n_pontos`, `updated_at`, `nota_prova`, `aprovada`, `total`, `created_at`, `curso`) VALUES(2, 10.0, '2012-11-28 10:52:10', 100.0, 1, 110.0, '2012-11-28 10:52:10', 'PEB2 - PORTUGUES')
---
  def create
    @apuracao = Apuracao.new(params[:apuracao])

    respond_to do |format|
      if @apuracao.save

SELECT * FROM `apuracaos` WHERE (`apuracaos`.`id` = 1)
UPDATE `apuracaos` SET `nota_prova` = 20.0, `formulario_id` = 1, `updated_at` = '2012-12-04 11:27:02', `total` = 30.0, `aprovada` = 1 WHERE `id` = 1
---
  def update
    @apuracao = Apuracao.find(params[:id])

    respond_to do |format|
      if @apuracao.update_attributes(params[:apuracao])

SELECT * FROM `formularios` WHERE (disciplina = NULL and ativo = 1 and documentacao_entregue = 1)
---
  def seleciona_curso
    if params[:sel_curso].to_s == "TODOS"
      @inscritos = Formulario.all(:include => :apuracao,:conditions => ["ativo = 1 and documentacao_entregue = 1 and id not in (select formulario_id from apuracaos)"])

SELECT * FROM `apuracaos` WHERE (apuracaos.curso = 'PEB2 - CIENCIAS') ORDER BY total DESC
---
  def classificacao
#    if params[:search][:curso_equals] == "TODOS"
#      @search = Apuracao.search(:all)
#    else
      @search = Apuracao.search(params[:search])

SELECT * FROM `formularios` WHERE (ativo = 1 and documentacao_entregue = 1)
SELECT * FROM `apuracaos` WHERE (`apuracaos`.`formulario_id` = 2) LIMIT 1
---
  def inscrito
    begin
      inscricao = Formulario.find(params[:inscrito])
      @formulario = @apuracao = Apuracao.find_by_formulario_id(inscricao.id)

SELECT * FROM `formularios` WHERE (ativo = 1 and documentacao_entregue = 1) ORDER BY nome ASC
---
  def load_resources
    @inscritos = Formulario.all(:conditions => ["ativo = 1 and documentacao_entregue = 1"],:order => 'nome ASC')