app/controllers/formularios_controller.rb

SELECT * FROM `formularios`
SELECT * FROM `formularios` WHERE (nome like '%nome_likeFlavioorder%') AND (formularios.nome LIKE '%Flavio%') LIMIT 0, 15
SELECT count(*) AS count_all FROM `formularios` WHERE (ativo = 1)
---
  def index
      if params[:search].blank?
          @search = Formulario.search(params[:search])
          @formularios = @search.paginate(:page=>params[:page],:per_page =>15, :conditions => ["ativo = 1"])

SELECT * FROM `formularios` WHERE (`formularios`.`id` = 1)
---
  def show
    @formulario = Formulario.find(params[:id])

INSERT INTO `formularios` (`dt_nasc`, `cidade`, `pis`, `cpf`, `horario`, `nome`, `n_filhos`, `updated_at`, `numero`, `cep`, `complemento`, `bairro`, `estado_civil`, `telefone`, `celular`, `rg`, `email`, `funcao`, `disciplina`, `created_at`, `endereco`, `exerce_funcao`, `graduacao`) VALUES('1985-12-22', 'Campinas', NULL, '339.082.608-41', 'MANHA', 'Alexandre Soares', 0, '2012-11-05 12:31:04', 1046, '13.084-060', '', 'Barão Geraldo', 'SOLTEIRO(A)', '(19)3289-4314', '(19)9263-1244', '30.173.542-6', 'alexandre@seducpma.com', NULL, 'PROFESSORA DE CRECHE', '2012-11-05 12:31:04', 'Angelo Vicentin', 0, 'Tecnologia PD')
---
  def create
    @formulario = Formulario.new(params[:formulario])
    if @formulario.save

SELECT * FROM `formularios` WHERE (`formularios`.`id` = 1)
---
  def edit
    @formulario = Formulario.find(params[:id])

SELECT * FROM `formularios` WHERE (`formularios`.`id` = 1)
UPDATE `formularios` SET `documentacao_entregue` = 0, `updated_at` = '2012-12-06 15:04:42', `obs` = 'teste' WHERE `id` = 445
---
  def update
    @formulario = Formulario.find(params[:id])
    if @formulario.update_attributes(params[:formulario])

SELECT * FROM `formularios` WHERE (`formularios`.`id` = 1332)
DELETE FROM `formularios` WHERE `id` = 1332
---
  def destroy
    @formulario = Formulario.find(params[:id])
    if logged_in?
      @formulario.gera_log(current_user.id, "Exclusão de inscrição efetuada")
    end
    @formulario.destroy

SELECT * FROM `formularios` WHERE (ativo = 1) AND (formularios.disciplina = 'PROFESSORA DE CRECHE') ORDER BY nome
---
  def listagem_por_curso
      if params[:search].blank?
          @search = Formulario.search(params[:search])

SELECT * FROM `formularios` WHERE (disciplina = 'PROFESSORA DE CRECHE')
---
  def impressao
      @formularios = Formulario.all(:conditions => ["ativo = 1 and disciplina = ?",params[:search]], :order => "nome")

SELECT * FROM `formularios` WHERE (documentacao_entregue = 1)
---
  def ativo
    @formularios = Formulario.all(:conditions => ["documentacao_entregue = 1"])

SELECT * FROM `formularios` WHERE ((ativo = 0 or documentacao_entregue = 0) and disciplina like 'PROFESSORA DE CRECHE')
---
  def cancelados
    if params[:nome].present?
      @formularios = Formulario.all(:conditions => ["(ativo = 0 or documentacao_entregue = 0) and nome like ?", "%"+params[:nome]+"%"])