app/controllers/homes_controller.rb

SELECT * FROM `formularios` WHERE (`formularios`.`id` = 1)
---
  def buscar
    if params[:search].present?
      @inscricao = Formulario.find(params[:search].to_i)

SELECT * FROM `formularios` WHERE (pis like '2147483647')
---
  def email_geral
    if params[:confirma].present?
      @geral = Formulario.all(:conditions => ["pis like '2147483647'"])

SELECT * FROM `formularios` WHERE (cpf like '339.082.608-41') AND (`formularios`.`cpf` IS NULL) LIMIT 1
---
  def busca_cpf
    if params[:search_cpf].present?
      @search = Formulario.all(:conditions => ["cpf like ?",params[:search_cpf]])

SELECT * FROM `formularios` WHERE (`formularios`.`id` = 1 AND (cpf like 'params[:home][:id]'))
---
  def libera_privacy
    @inscricao = Formulario.find(params[:home][:id], :conditions => ["cpf like ?", params[:home][:cpf]])