app/controllers/users_controller.rb

SELECT * FROM `users` ORDER BY login
---
  def index
    @users = User.all :order => "login"

INSERT INTO `users` (`created_at`, `updated_at`, `remember_token`, `login`, `email`, `crypted_password`, `name`, `remember_token_expires_at`, `salt`) VALUES('2012-11-08 11:51:10', '2012-11-08 11:51:10', NULL, 'seduc.rh', 'rh.seduc@americana.sp.gov.br', '372e1b6708ec62bd1bcf7a2c21cb31484290d37c', '', NULL, '328bab5108c685b61bce0ac439a59fcde70966e0')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    Notificador.deliver_notificar(@user)
    @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
 def associar
   @user = User.find(params[:user][:user_id])